{
  "backend/main.mo": "Motoko backend handling public application submissions and admin‑restricted retrieval of sorted applications with access control.",
  "feature_evidence.json": "Defines feature evidence metadata mapping features to related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base layers and OKLCH color variables defining light/dark theme tokens and global styling.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, global layout, route definitions, and a safe footer referral link.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button using Internet Identity with login/logout handling and loading states.",
  "frontend/src/components/site/HeaderNav.tsx": "Header navigation with logo, public route links, mobile menu, and Apply CTA button.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, reinitializing on identity changes.",
  "frontend/src/hooks/useAdminApplications.ts": "Fetches admin‑only application list via actor with most‑recent‑first sorting and error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login state and persisted identity handling.",
  "frontend/src/hooks/useIsAdmin.ts": "Queries the backend to determine whether the current authenticated caller is an admin.",
  "frontend/src/hooks/useQueries.ts": "Empty module reserved for organizing query-related hooks.",
  "frontend/src/hooks/useSubmitApplication.ts": "Handles submitting application data through the backend actor with loading and error state management.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom theme variables for the RICHUAL UI, including colors and utilities.",
  "frontend/src/lib/validation/applyApplication.ts": "Validates application form input fields and returns structured errors and validity status.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with themed sections describing the philosophy and system behind RICHUAL.",
  "frontend/src/pages/AdminApplicationsPage.tsx": "Displays admin-only application listings with authentication, authorization checks, and error states.",
  "frontend/src/pages/ApplyPage.tsx": "Renders the application form with validation, submission handling, and a success confirmation view.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero imagery, rank previews, and navigation to the application form.",
  "frontend/src/pages/MembershipPage.tsx": "Displays membership benefits and outlines the multi-step application process.",
  "frontend/src/pages/ProgramsPage.tsx": "Shows the four-rank program structure with descriptions and focus areas for each level.",
  "frontend/src/pages/RitualPhilosophyPage.tsx": "Presents core rituals with descriptions and practices, emphasizing the program's philosophical foundation.",
  "frontend/src/utils/routes.ts": "Defines public route constants and navigation items for the frontend.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL parameters using query strings and session storage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, plugins, and global styling settings.",
  "project_state.json": "Tracks project state, requirements, known issues, and feature definitions for building and deploying the RICHUAL brand website. Contains schema metadata, stack notes, and a list of implemented or planned site features."
}