{
  "backend/main.mo": "Motoko canister managing application submissions with public submit endpoint and admin‑restricted retrieval sorted by timestamp.",
  "feature_evidence.json": "Feature evidence report mapping site features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of short summaries for all frontend files used in the project.",
  "frontend/index.css": "Global Tailwind base styles defining color variables and dark theme rules for the RICHUAL visual system.",
  "frontend/index.html": "Root HTML document providing mount point and script loader for the React app.",
  "frontend/src/App.tsx": "Main React router setup defining page routes and shared layout with header and footer.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth with loading states and styling.",
  "frontend/src/components/site/HeaderNav.tsx": "Responsive header navigation with logo, desktop/mobile menus, and Apply CTA.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching authenticated/anonymous backend actor and refreshing dependent queries on change.",
  "frontend/src/hooks/useAdminApplications.ts": "Hook fetching admin‑only application list using actor, sorted by newest first.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity, handling auth client creation, login state, and exposing identity and status helpers.",
  "frontend/src/hooks/useIsAdmin.ts": "Runs a query to check whether the current authenticated caller has admin privileges.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file noting that queries are implemented in dedicated hooks.",
  "frontend/src/hooks/useSubmitApplication.ts": "Defines a hook to submit an application via the backend actor, tracking submission state and errors.",
  "frontend/src/index.css": "Tailwind CSS setup with custom RICHUAL theme variables, typography, and utility classes.",
  "frontend/src/lib/validation/applyApplication.ts": "Validates application form data and returns field-specific errors along with overall validity.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with styled sections describing RICHUAL's philosophy and system.",
  "frontend/src/pages/AdminApplicationsPage.tsx": "Displays admin-only application listings with authentication checks and conditional UI states.",
  "frontend/src/pages/ApplyPage.tsx": "Handles the application form UI, validation, submission, and post-submit confirmation flow.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero, concept, and ranks sections using Tailwind and navigation to the apply page.",
  "frontend/src/pages/MembershipPage.tsx": "Displays membership details, benefits, and a multi‑step application process with styled sections.",
  "frontend/src/pages/ProgramsPage.tsx": "Shows four rank-based training programs with descriptions and focus areas in a styled grid layout.",
  "frontend/src/pages/RitualPhilosophyPage.tsx": "Outlines core rituals with icons, descriptions, and practices, grouped in alternating layout sections.",
  "frontend/src/utils/urlParams.ts": "Utility functions for getting, storing, retrieving, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, shadows, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Tracks project state, requirements, and design assets for building the RICHUAL website, including features, themes, and image needs."
}